{"id":1352,"date":"2012-04-26T14:02:55","date_gmt":"2012-04-26T14:02:55","guid":{"rendered":"http:\/\/drjeffreyleemddmd.com\/?page_id=1352"},"modified":"2021-11-18T04:37:34","modified_gmt":"2021-11-18T04:37:34","slug":"tooth-extractions","status":"publish","type":"page","link":"https:\/\/drjeffreyleemddmd.com\/patient-testimonials\/tooth-extractions\/","title":{"rendered":"Tooth Extractions"},"content":{"rendered":"<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I had to get two teeth pulled and I was so scared. The staff told me that Dr. Lee was the best so I trusted them, they took me in and he said, &#8216;just trust me&#8217;, so I did. I didn’t feel anything and I asked him if he was done and he said, &#8216;yes&#8217; and I didn’t believe him so I looked and he was done. I fell asleep and I woke up and I was done. I was thinking if I hadn’t trusted him I would have been crying. So trust him! He is great.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-V.K.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“First consult and tooth extraction done on the same day, single visit. Everyone in the office is helpful.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-F.C.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I have had Dr. Lee conduct surgery on my teeth in two occasions. The first was when I attended my regular orthodontist and he discovered that I had three extra teeth growing in my gums. He told me that I would need surgery and suggested Dr. Lee. But me being the typical teenager I brushed it off until the pain was too much to endure. I finally made an appointment for the surgery. Dr. Lee and his staff were very helpful. They explained all the procedures before starting. I was more impressed by the cleanliness of his office. I recuperated with no pain and minimal swelling. When my regular dentist said that I needed my wisdom teeth removed I knew I wouldn&#8217;t go anywhere else except for the office of Dr. Jeffrey Lee.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-Juan<\/p>\n<hr \/>\n<p style=\"text-align: center;\">“I came in the office as an emergency patient. Having called many offices to pull my tooth after a root canal this was the only office that would accommodate me. I feel extremely fortunate that this office said yes and am more than happy with my experience.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-V.T.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“Dr. Lee is truly a great Oral Surgeon. My daughter recently had four wisdom teeth removed. She was apprehensive. From the first visit to the last follow up Dr. Lee &amp; his staff cared and took her concerns to heart. The procedure went smoothly and her recovery was unbelievably short and pain free. He is awesome!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-J.C.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“Everything was straightforward and the procedure was done that day. It was very quick. Assistants told me everything that was going to happen. Very clean and nice environment. I was scared to death but the doctor calmed my nerves right away and before I realized it my wisdom teeth were gone!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-K.R.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“My wisdom tooth extraction and recovery went smoothly and comfortably.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-N.P.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I checked out other dentists and oral surgeons before I met with Dr. Lee and they were either confusing or rude. I was so scared to have my wisdom teeth pulled, but Dr. Lee and his staff made me feel so comfortable and relaxed with their super niceness and knowledge over the matter. My overall experience with them was awesome! Highly recommend them!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-J.K.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I have to admit I was beyond terrified to get my wisdom teeth taken out. This was only because my regular dentist tried to take one out and was unsuccessful. I didn&#8217;t want to go through another failed attempt so I had him refer me to an oral surgeon. He referred me to two, but I went with Dr. Lee after reading all these positive reviews. He didn&#8217;t disappoint! Dr. Lee was great&#8230;he made me feel at ease and he was very knowledgeable. It also helped that the staff were caring and friendly. Due to insurance coverage, I had to have two separate procedures to extract my teeth two at a time. I wanted to be sedated both times and both times the procedure went smoothly! I had little pain after and healed quickly. I just wish I would have known about Dr. Lee sooner instead of waiting so long to get the procedure done. I would HIGHLY recommend him to anyone!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-M.C<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I had heard horror stories about the pain following wisdom teeth extractions, but I never even had to touch the pain meds.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-N.R.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“No pain during extraction.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-K.K.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“It was not a bad experience at all. Dr. Lee did a fantastic surgery. Wisdom extraction took only 30 minutes under general anesthesia. His assistant was very pleasant, helpful and efficient.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-C.A.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“My experience with Dr. Lee was great. I went to him for wisdom teeth extractions. I had just given birth about a week ago when my wisdom teeth started giving me trouble, so I went to Dr. Lee. When I first walked in I was a bit nervous, but his super nice staff helped with that. When I spoke to Dr. Lee he made me feel so much better explaining everything and answering all my questions. During surgery I felt no pain, and the aftermath was the same I was back to doing my regular activities the next day. I would highly recommend Dr. Lee to all my friends and family :)”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-N.O.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“Pulling wisdom teeth sucks no matter what, but if you have to this is the place to do it. Everyone is friendly and professional and I really appreciated the calls after the procedure just to make sure all is well.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-R.T.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I had my wisdom teeth removed by Dr. Lee. I had my examination done and thought I was going to do surgery a different day. When Dr. Lee told me he could do everything on one visit I got nervous. Now I am glad I had everything done that same day. I had a great experience minimal pain, some swelling and my recovery was pretty fast. I would highly recommend him.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-Amarieo<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“Wisdom tooth extraction is not a fun experience, but Dr. Lee did a good job!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-P.K.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I had excellent surgeries for my wisdom teeth and pulling out four teeth for braces. I had no pain and recovered quickly after the surgery. I highly recommend Dr. Lee dentist. The staff is very friendly. Thank you guys so much!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-N.U.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“Staff are very professional and have great knowledge for what they do. Dr. Lee took care of my wisdom teeth.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-Anonymous<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I recently flew out from Colorado to see Dr. Jeffrey Lee on a friend&#8217;s recommendation. I have always been fearful of dentistry, but after my surgery I could not believe how stress-free the whole procedure was! The staff were extremely caring, friendly and professional. When I woke up after the sedation, I could not believe that they were already done! I healed very quickly and am very satisfied with the results I got. I highly recommend Dr. Jeffrey Lee to anyone who needs oral surgery. I am confident that they will get excellent results!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-Joycie<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I recently went into Dr. Jeffrey Lee&#8217;s office to have four of my wisdom teeth removed and I absolutely dreaded the idea. However, once I walked into the office the staff was very sweet and helpful as they walked me through the process step by step and reassured me that I had nothing to be worried about. To my surprise, everything went smooth and my recovery was excellent, I didn&#8217;t even swell the next day! I felt &#8216;dandy as candy&#8217; and I couldn&#8217;t thank Dr. Lee enough for making my procedure so easy for me. My friends at school were impressed that I went to class the next day and I told them they all have to go to Dr. Lee!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-N.N.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I took my 16 yr old daughter to Dr. Lee to have her wisdom teeth extracted. She was so nervous to have the procedure done. Upon our arrival to the office the staff picked up on this and were quick to reassure her that she was in good hands. The procedure went smooth and my daughter has had a very speedy recovery! Dr. Lee called me himself after the procedure to check on my daughter. We were referred to Dr. Lee and we have referred people since. Dr. Lee is an amazing surgeon. I highly recommend him to anyone looking for a professional and caring oral surgeon. Thank you to the office of Dr. Jeffrey Lee.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-S.B.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“My friend told me that Dr. Jeffrey Lee was an oral surgeon and a medical doctor and would take good care of my 2 children when they needed surgery. I was very nervous because my children had never had any drugs or surgery. Both of my teenagers sailed right through the experience on Friday morning after the consultation. They had all of their questions answered and really liked the doctor and nurses. I did not have to fill the prescription for a pain killer; Advil was enough to handle the pain for the 1st 24 hours and then they didn&#8217;t need anything! They were back to school on Monday morning. I couldn&#8217;t be happier or more relieved as a mom. Dr. Jeffrey Lee and his staff were exceptional, and I recommend him to all the moms I know.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-Robbie<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I was very happy to have had my surgery performed by Dr. Lee. I had all four of my wisdom teeth extracted, and although I was expecting the worst I had no pain after the surgery! I have heard from others that Dr. Lee is an excellent surgeon, but I was not expecting to have no pain after having my wisdom teeth removed all at once. Not only that, his staff were very warm and professional &#8211; being in an inviting environment right before surgery is so nice to have! I truly felt cared for, from the beginning to the end and I definitely recommend Dr. Lee to anybody who needs oral surgery!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-Priscilla<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“Dr. Lee is a great oral surgeon who cares about his patients. Even though him and his staff are very busy he makes you feel cared for and special. I got my wisdom teeth out and he make my experience very calming and I understood everything that would happen. I highly recommend Dr. Lee!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-T.P.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I was home in Northern California during Christmas break when my wisdom teeth began to bother me. My dentist from back home referred me to Dr. Lee. The staff and Dr. Lee got me an appointment as soon as they could. The three days until my appointment I heard every horror story possible about wisdom tooth extractions ranging from extreme swelling to pain that made them cry for three days afterwards. Coming in to Dr. Lee’s office I was impressed and amazed by how friendly the staff were. Throughout the explanation of and the procedure everything was laid out for me. Afterwards there was little pain and hardly any swelling. Everyone couldn’t believe I had wisdom teeth removed. Thank you for being so welcoming and making a ‘scary’ process easier to deal with!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-A.D.<\/p>\n<hr \/>\n<p style=\"text-align: center;\">“I came into this surgery having heard horror stories about the pain and discomfort of having wisdom teeth extracted, but I ended up sailing through it without a single painkiller. The surgery was very easy and the staff made me very comfortable, especially since this was my first surgery. Thanks Dr. Lee.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-J.C.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“Dr. Lee and his staff made a very unpleasant situation of extracting 3 of my wisdom teeth – at age 50 – a very pleasant experience! I experienced no pain thru the whole ordeal and was given explicit instructions how to maintain the best of the care once I was home. I was given a phone call beforehand of what to expect and what my responsibilities were to be before surgery so I was put at ease immediately. The care at Dr. Lee’s office was very thorough and efficient and given with compassion as I was scared to death and not looking forward to this procedure. Thank you Dr. Lee and your professional staff for giving me such professional and a positive experience!<\/p>\n<p style=\"text-align: center;\" align=\"center\">-S.B.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“Getting your wisdom teeth out is not fun but I wouldn’t recommend any other place but here!”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-D.B.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“Dr. Lee does a wonderful job extracting wisdom teeth. I experienced only minimal pain and swelling and have experienced a quick recovery.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-A.S.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“At first I thought that getting my wisdom teeth removed would be real painful. But Dr. Lee assured me that I shouldn’t be in much pain if it was taken out correctly. I heard so many scary stories from friends and family about places and doctors that they’ve been to, and I’m real glad I went to Dr. Lee because he did a great job with the removal of my wisdom teeth, I didn’t feel any pain. Thank you.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">– J.L.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I was so nervous about having my wisdom teeth taken out. Everyone told me it was painful and that my cheeks would turn purple. Well, so, I did end up looking like a chipmunk. But it was <span style=\"text-decoration: underline;\">so<\/span> not as bad as everyone said it was and the procedure was so easy! Thank you!<\/p>\n<p style=\"text-align: center;\" align=\"center\">–S.C.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“Quick, painless, a good wisdom tooth extraction experience.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-L.G.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“This has been one of the best doctors that could remove your wisdom teeth. No pain at all. You will be satisfied.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-P.T.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“This is a great place to get your wisdom teeth removed then any other place. Recommended for teenagers that are scared to get theirs’ removed.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-P.T.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“I believe Dr. Lee did an extremely good job with my extractions, as the swelling was very minimal and I experienced no complications.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-H.C.<\/p>\n<hr \/>\n<p style=\"text-align: center;\" align=\"center\">“Great doctor as well as great staff. My operation, wisdom teeth extraction, went surprisingly and incredibly well.”<\/p>\n<p style=\"text-align: center;\" align=\"center\">-C.F.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“I had to get two teeth pulled and I was so scared. The staff told me that Dr. Lee was the best so I trusted them, they took me in and he said, &#8216;just trust me&#8217;, so I did. I didn’t feel anything and I asked him if he was done and he said, &#8216;yes&#8217; [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":774,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Tooth Extraction Testimonials | Office of Jeffrey Lee, MD DMD<\/title>\n<meta name=\"description\" content=\"Patients are highly recommending Dr. Lee for tooth extractions. They claim him and his staff are very helpful and caring. Read these testimonials.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/drjeffreyleemddmd.com\/patient-testimonials\/tooth-extractions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Tooth Extraction Testimonials | Office of Jeffrey Lee, MD DMD\" \/>\n<meta property=\"og:description\" content=\"Patients are highly recommending Dr. Lee for tooth extractions. They claim him and his staff are very helpful and caring. Read these testimonials.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/drjeffreyleemddmd.com\/patient-testimonials\/tooth-extractions\/\" \/>\n<meta property=\"og:site_name\" content=\"Office of Jeffrey Lee, MD DMD\" \/>\n<meta property=\"article:modified_time\" content=\"2021-11-18T04:37:34+00:00\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#organization\",\"name\":\"Office of Jeffrey Lee, MD DMD\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/\",\"sameAs\":[],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/wp-content\/uploads\/2013\/01\/feat-dr-lee-dr-suit.jpg\",\"contentUrl\":\"https:\/\/drjeffreyleemddmd.com\/wp-content\/uploads\/2013\/01\/feat-dr-lee-dr-suit.jpg\",\"width\":430,\"height\":290,\"caption\":\"Office of Jeffrey Lee, MD DMD\"},\"image\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#website\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/\",\"name\":\"Office of Jeffrey Lee, MD DMD\",\"description\":\"Board Certified Oral &amp; Maxillofacial Surgeon\",\"publisher\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/drjeffreyleemddmd.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/patient-testimonials\/tooth-extractions\/#webpage\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/patient-testimonials\/tooth-extractions\/\",\"name\":\"Tooth Extraction Testimonials | Office of Jeffrey Lee, MD DMD\",\"isPartOf\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#website\"},\"datePublished\":\"2012-04-26T14:02:55+00:00\",\"dateModified\":\"2021-11-18T04:37:34+00:00\",\"description\":\"Patients are highly recommending Dr. Lee for tooth extractions. They claim him and his staff are very helpful and caring. Read these testimonials.\",\"breadcrumb\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/patient-testimonials\/tooth-extractions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/drjeffreyleemddmd.com\/patient-testimonials\/tooth-extractions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/patient-testimonials\/tooth-extractions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/drjeffreyleemddmd.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Patient Testimonials\",\"item\":\"https:\/\/drjeffreyleemddmd.com\/patient-testimonials\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Tooth Extractions\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/1352"}],"collection":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/comments?post=1352"}],"version-history":[{"count":16,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/1352\/revisions"}],"predecessor-version":[{"id":2275,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/1352\/revisions\/2275"}],"up":[{"embeddable":true,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/774"}],"wp:attachment":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/media?parent=1352"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}