{"id":42,"date":"2011-12-06T02:15:05","date_gmt":"2011-12-06T02:15:05","guid":{"rendered":"http:\/\/www.oralsurgeonorangecounty.org\/?page_id=42"},"modified":"2012-05-14T15:32:08","modified_gmt":"2012-05-14T15:32:08","slug":"bone-grafting","status":"publish","type":"page","link":"https:\/\/drjeffreyleemddmd.com\/procedures\/bone-grafting\/","title":{"rendered":"Bone Grafting"},"content":{"rendered":"<hr \/>\n<h1 style=\"text-align: left;\" align=\"center\"><strong><\/strong><strong>What is Bone Grafting?<\/strong><\/h1>\n<h3 style=\"text-align: left;\" align=\"center\">Major and Minor Bone Grafting<\/h3>\n<p>Over a period of time, the jawbone associated with missing teeth atrophies or is reabsorbed. This often leaves a condition in which there is poor quality and quantity of bone suitable for placement of dental implants.<\/p>\n<p>Today, we have the ability to grow bone where needed. This not only gives us the opportunity to place implant of proper length and width, it also gives us a chance to restore functionality and esthetic appearance.<\/p>\n<p>Bone grafting is needed when there is a defect in the bone which occurs after long term tooth loss or traumatic tooth loss. Bone grafting is often closely associated with dental restorations, such as bridge work and dental implants. In the majority of cases, the success of a restoration procedure can hinge on the height, depth and width of the jawbone at the implant site. Bone grafting can increase the height or width of the jawbone and fill in voids and defects in the bone. We usually perform bone grafts to prepare the jaw bone to accept dental implants or to enhance the support around failing teeth.  Bone grafting is a fairly common procedure that is used frequently for dental implants and other periodontal procedures.<\/p>\n<p>Bone grafting and implant placement may be performed separately or together, depending upon the individual&#8217;s condition.  Bone grafting is possible because bone tissue, unlike most other tissues, has the ability to regenerate completely if provided the space into which to grow. As native bone grows it will generally replace the graft material completely, resulting in a fully integrated region of new bone.<\/p>\n<p>Bone grafting and implant placement are highly skilled disciplines, best performed by oral surgeons who are well trained and perform this procedure daily.<\/p>\n<hr \/>\n<h3 style=\"text-align: left;\" align=\"center\">Major Bone Grafting<\/h3>\n<p>Bone grafting can repair implant sites with inadequate bone structure due to previous extractions, gum disease or injuries.  There are several areas of the body that are suitable for attaining bone grafts. The bone is either obtained from a tissue bank or your own bone is taken from the skull, jaw, hip or tibia (lower leg bone).  Sinus bone grafts are also performed to replace bone in the posterior upper jaw.  In addition, special membranes may be utilized that dissolve under the gum and protect the bone graft and encourage bone regeneration.  This is called guided bone regeneration or guided tissue regeneration.<\/p>\n<p>Major bone grafts are typically performed to repair defects of the jaws.  These defects may arise as a result of traumatic injuries, tumor surgery or congenital defects.  Large defects are repaired using the patient’s own bone.  This bone is harvested from a number of different sites depending on the size of the defect.  The skull (cranium), hip (iliac crest) and lateral knee (tibia) are common donor sites.  These procedures are routinely performed in an operating room and require a hospital stay.<\/p>\n<hr \/>\n<h3 style=\"text-align: left;\">The Importance of Teeth for Jaw Bone Health<\/h3>\n<p>When one or more teeth are missing, it can lead to jawbone loss at the site of the gap. This loss of jawbone can develop into additional problems, both with your appearance and your overall health. You may experience pain, problems with your remaining teeth, altered facial appearance and eventually even the inability to speak and eat normally.<\/p>\n<p><strong><\/strong>In that same way that muscles are maintained through exercise, bone tissue is maintained by use. Natural teeth are embedded in the jawbone and stimulate the jawbone through activities such as chewing and biting. When teeth are missing, the alveolar bone (the portion of the jawbone that anchors the teeth in the mouth) no longer receives the necessary stimulation and begins to break down or resorb. The body no longer uses or “needs” the jawbone, so it deteriorates and goes away.<\/p>\n<hr \/>\n<h3 style=\"text-align: left;\" align=\"center\"> Potential Consequences of Tooth and Jawbone Loss<\/h3>\n<ul>\n<li style=\"text-align: left;\">Problems with remaining teeth including misalignment, drifting, loosening and loss<\/li>\n<li style=\"text-align: left;\">Collapsed facial profile<\/li>\n<li style=\"text-align: left;\">Limited lip support<\/li>\n<li style=\"text-align: left;\">Skin wrinkling around the mouth<\/li>\n<li style=\"text-align: left;\">Distortion of other facial features<\/li>\n<li style=\"text-align: left;\">Jaw (temporomandibular joint <span style=\"text-decoration: underline;\">[TMJ]<\/span>) pain, facial pain and headaches<\/li>\n<li style=\"text-align: left;\">Difficulty speaking and communicating<\/li>\n<li style=\"text-align: left;\">Inadequate nutrition as a result of the inability to chew properly and painlessly<\/li>\n<li style=\"text-align: left;\">Sinus expansion<\/li>\n<\/ul>\n<hr \/>\n<h3 style=\"text-align: left;\">Reasons for Jawbone Loss and Deterioration<\/h3>\n<p>The following are the most common causes for jawbone deterioration and loss that may require a bone grafting procedure:<\/p>\n<p><em>Tooth Extractions:<\/em><\/p>\n<p>When an adult tooth is removed and not replaced, jawbone deterioration may occur. Natural teeth are embedded in the jawbone and stimulate the jawbone through activities such as chewing and biting. When teeth are missing, the alveolar bone (the portion of the jawbone that anchors the teeth in the mouth) no longer receives the necessary stimulation and begins to break down or resorb. The body no longer uses or “needs” the jawbone, so it deteriorates and goes away.<\/p>\n<p>The rate the bone deteriorates, as well as the amount of bone loss that occurs, varies greatly among individuals. However most loss occurs within the first eighteen months following the extraction and continues throughout life.<\/p>\n<p><em>Periodontal Disease: <\/em><\/p>\n<p>Periodontal diseases are ongoing infections of the gums that gradually destroy the support of your natural teeth. Periodontal disease affects one or more of the periodontal tissues: alveolar bone, periodontal ligament, cementum or gingiva. While there are many diseases which affect the tooth-supporting structures, plaque-induced inflammatory lesions make up the majority of periodontal issues and are divided into two categories: gingivitis and periodontitis. While gingivitis — the less serious of the diseases — may never progress into periodontitis, it always precedes periodontitis.<\/p>\n<p>Dental plaque is the primary cause of gingivitis in genetically-susceptible individuals. Plaque is a sticky colorless film, composed primarily of food particles and various types of bacteria, which adhere to your teeth at and below the gum line. Plaque constantly forms on your teeth even minutes after cleaning. Bacteria found in plaque produce toxins or poisons that irritate the gums. Gums may become inflamed, red, swollen and bleed easily. If this irritation is prolonged the gums separate from the teeth causing pockets (spaces) to form. If daily brushing and flossing is neglected, plaque can also harden into a rough, porous substance known as calculus (or tartar). This can occur both above and below the gum line.<\/p>\n<p>Periodontitis is affected by bacteria that adhere to the tooth’s surface, along with an overly aggressive immune response to these bacteria. If gingivitis progresses into periodontitis, the supporting gum tissue and bone that holds teeth in place deteriorates. The progressive loss of the alveolar bone can lead to loosening and subsequent loss of teeth.<\/p>\n<p><em>Dentures\/Bridgework: <\/em><\/p>\n<p>Unanchored dentures are placed on top of the gum line and therefore do not provide any direct stimulation to the underlying alveolar bone. Over time, the lack of stimulation causes the bone to resorb and deteriorate. Because this type of denture relies on the bone to hold them in place, people often experience loosening of their dentures and problems eating and speaking. Eventually bone loss may become so severe that dentures cannot be held in place even with strong adhesives and a new set may be required. Proper denture care, repair and refitting are essential to maintaining oral health.<\/p>\n<p>Some dentures are supported by anchors, which do help adequately stimulate and therefore preserve bone.<\/p>\n<p>With bridgework, the teeth on either side of the appliance provide sufficient stimulation to the bone, but the portion of the bridge that spans the gap where the teeth are missing receives no direct stimulation. Bone loss can occur in this area.<\/p>\n<p>By completing a bone graft procedure, Dr. Lee is now able to restore bone function and growth, thereby halting the effects of poor denture care.<\/p>\n<p><em>Trauma:<\/em><\/p>\n<p>When a tooth is knocked out or broken to the extent that no biting surface is left below the gum line, bone stimulation stops and this results in jaw bone loss. Some common forms of tooth and jaw trauma include: teeth knocked out from injury or accident, jaw fractures or teeth with a history of trauma that may die and lead to bone loss years after the initial trauma.<\/p>\n<p>A bone grafting procedure would be necessary to reverse the effects of bone deterioration, restoring function and promoting new bone growth in traumatized areas.<\/p>\n<p><em>Misalignment:<\/em><\/p>\n<p><em><\/em>Misalignment issues can create a situation in the mouth where some teeth no longer have an opposing tooth structure. The unopposed tooth can over-erupt, causing deterioration of the underlying bone.<\/p>\n<p>Issues such as TMJ problems, normal wear-and-tear and lack of treatment can also create abnormal physical forces that interfere with the teeth’s ability to grind and chew properly. Over time, bone deterioration can occur where bone is losing stimulation.<\/p>\n<p><em>Osteomyelitis: <\/em><\/p>\n<p><em><\/em>Osteomyelitis is a type of bacterial infection in the bone and bone marrow of the jaw. The infection leads to inflammation, which can cause a reduction of blood supply to the bone. Treatment for osteomyelitis generally requires antibiotics and removal of the affected bone. A bone graft procedure may then be required to restore bone function and growth lost during removal.<\/p>\n<p><em>Tumors: <\/em><\/p>\n<p>Benign facial tumors, though generally non-threatening, may grow large and require removal of a portion of the jaw. Malignant mouth tumors almost always spread into the jaw, requiring removal of a section of the jaw. In both cases reconstructive bone grafting is usually required to help restore function to the jaw. Grafting in patients with malignant tumors may be more challenging because treatment of the cancerous tumor generally requires removal of surrounding soft tissue as well.<\/p>\n<p><em>Developmental Deformities:<\/em><\/p>\n<p>Some conditions or syndromes known as birth defects are characterized by missing portions of the teeth, facial bones, jaw or skull. Dr. Lee may be able to perform a bone graft procedure to restore bone function and growth where it has been absent.<\/p>\n<p><em>Sinus Deficiencies:<\/em><\/p>\n<p>When molars are removed from the upper jaw, air pressure from the air cavity in the maxilla (maxillary sinus), causes resorption of the bone that formerly helped the teeth in place. As a result the sinuses become enlarged — a condition called hyperneumatized sinus.<\/p>\n<p>This condition usually develops over several years and may result in insufficient bone for the placement of dental implants. Dr. Lee can perform a procedure called a “sinus lift” that can treat enlarged sinuses.<\/p>\n<hr \/>\n<h3 style=\"text-align: left;\" align=\"center\">Types of Bone Grafts<\/h3>\n<p><em>Autogenous Bone Grafts: <\/em><\/p>\n<p>Autogenous bone grafts, also known as autografts, are made from your own bone, taken from somewhere else in the body. The bone is typically harvested from the chin, jaw, lower leg bone, hip or the skull. Autogenous bone grafts are advantageous in that the graft material is live bone, meaning it contains living cellular elements that enhance bone growth.<\/p>\n<p>However, one downside to the autograft is that it requires a second procedure to harvest bone from elsewhere in the body.<\/p>\n<p><em>Allogenic Bone:<\/em><\/p>\n<p><em><\/em>Allogenic bone, or allograft, is dead bone harvested from a cadaver, then processed using a freeze-dry method to extract the water via a vacuum. Unlike autogenous bone, allogenic bone cannot produce new bone on its own. Rather, it serves as a framework or scaffold over which bone from the surrounding bony walls can grow to fill the defect or void.<\/p>\n<p><em>Xenogenic Bone:<\/em><\/p>\n<p>Xenogenic bone is derived from non-living bone of another species, usually a cow. The bone is processed at very high temperatures to avoid the potential for immune rejection and contamination. Like allogenic grafts, xenogenic grafts serve as a framework for bone from the surrounding area to grow and fill the void.<\/p>\n<p>Both allogenic and xenogenic bone grafting are advantageous in that they do not require a second procedure to harvest your own bone, as with autografts. However, because these options lack autograft’s bone-forming properties, bone regeneration may take longer than with autografts, with a less predictable outcome.<\/p>\n<hr \/>\n<h3 style=\"text-align: left;\" align=\"center\">Bone Graft Substitutes<\/h3>\n<p>As a substitute to using real bone, many synthetic materials are available as a safe and proven alternative, including:<\/p>\n<p><em>Demineralized Bone Matrix (DBM)\/Demineralized Freeze-Dried Bone Allograft (DFDBA): <\/em><\/p>\n<p>This product is processed allograft bone, containing collagen, proteins and growth factors that are extracted from the allograft bone. It is available in the form of powder, putty, chips or as a gel that can be injected through a syringe.<\/p>\n<p><em>Graft Composites:<\/em><\/p>\n<p><em><\/em>Graft composites consist of other bone graft materials and growth factors to achieve the benefits of a variety of substances. Some combinations may include: collagen\/ceramic composite, which closely resembles the composition of natural bone, DBM combined with bone marrow cells, which aid in the growth of new bone or a collagen\/ceramic\/autograft composite.<\/p>\n<p><em>Bone Morphogenetic Proteins:<\/em><\/p>\n<p>Bone morphogenetic proteins (BMPs) are proteins naturally produced in the body that promote and regulate bone formation and healing. These proteins are created for bone grafting by the recruitment, proliferation and maturation of stem cells into bone producing cells.<\/p>\n<p style=\"text-align: left;\" align=\"center\">Synthetic materials also have the advantage of not requiring a second procedure to harvest bone, reducing risk and pain. Each bone grafting option has its own risks and benefits. Dr. Lee will determine which type of bone graft material is right for you.<strong><br \/>\n<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is Bone Grafting? Major and Minor Bone Grafting Over a period of time, the jawbone associated with missing teeth atrophies or is reabsorbed. This often leaves a condition in which there is poor quality and quantity of bone suitable for placement of dental implants. Today, we have the ability to grow bone where needed. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":36,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Bone Grafting | Office of Jeffrey Lee, MD DMD<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/drjeffreyleemddmd.com\/procedures\/bone-grafting\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Bone Grafting | Office of Jeffrey Lee, MD DMD\" \/>\n<meta property=\"og:description\" content=\"What is Bone Grafting? Major and Minor Bone Grafting Over a period of time, the jawbone associated with missing teeth atrophies or is reabsorbed. This often leaves a condition in which there is poor quality and quantity of bone suitable for placement of dental implants. Today, we have the ability to grow bone where needed. [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/drjeffreyleemddmd.com\/procedures\/bone-grafting\/\" \/>\n<meta property=\"og:site_name\" content=\"Office of Jeffrey Lee, MD DMD\" \/>\n<meta property=\"article:modified_time\" content=\"2012-05-14T15:32:08+00:00\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#organization\",\"name\":\"Office of Jeffrey Lee, MD DMD\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/\",\"sameAs\":[],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/wp-content\/uploads\/2013\/01\/feat-dr-lee-dr-suit.jpg\",\"contentUrl\":\"https:\/\/drjeffreyleemddmd.com\/wp-content\/uploads\/2013\/01\/feat-dr-lee-dr-suit.jpg\",\"width\":430,\"height\":290,\"caption\":\"Office of Jeffrey Lee, MD DMD\"},\"image\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#website\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/\",\"name\":\"Office of Jeffrey Lee, MD DMD\",\"description\":\"Board Certified Oral &amp; Maxillofacial Surgeon\",\"publisher\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/drjeffreyleemddmd.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/procedures\/bone-grafting\/#webpage\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/procedures\/bone-grafting\/\",\"name\":\"Bone Grafting | Office of Jeffrey Lee, MD DMD\",\"isPartOf\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#website\"},\"datePublished\":\"2011-12-06T02:15:05+00:00\",\"dateModified\":\"2012-05-14T15:32:08+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/procedures\/bone-grafting\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/drjeffreyleemddmd.com\/procedures\/bone-grafting\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/procedures\/bone-grafting\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/drjeffreyleemddmd.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Services\",\"item\":\"https:\/\/drjeffreyleemddmd.com\/procedures\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Bone Grafting\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/42"}],"collection":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/comments?post=42"}],"version-history":[{"count":11,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/42\/revisions"}],"predecessor-version":[{"id":1181,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/42\/revisions\/1181"}],"up":[{"embeddable":true,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/36"}],"wp:attachment":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/media?parent=42"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}