{"id":759,"date":"2012-03-05T19:38:44","date_gmt":"2012-03-05T19:38:44","guid":{"rendered":"http:\/\/drjeffreyleemddmd.com\/?page_id=759"},"modified":"2012-05-15T15:41:03","modified_gmt":"2012-05-15T15:41:03","slug":"impacted-canines","status":"publish","type":"page","link":"https:\/\/drjeffreyleemddmd.com\/procedures\/impacted-canines\/","title":{"rendered":"Impacted Canines"},"content":{"rendered":"<p>An impacted tooth simply means that it is “stuck” and cannot erupt into function. Patients frequently develop problems with impacted third molar (wisdom) teeth. These teeth get “stuck” in the back of the jaw and can develop painful infections among a host of other problems (see <a title=\"Wisdom Teeth\" href=\"http:\/\/drjeffreyleemddmd.com\/procedures\/wisdom-teeth\/\">Wisdom Teeth<\/a> under Services). Since there is rarely a functional need for wisdom teeth, they are usually extracted if they develop problems. The maxillary cuspid (upper eyetooth) is the second most common tooth to become impacted. The cuspid tooth is a critical tooth in the dental arch and plays an important role in your “bite”. The cuspid teeth are very strong biting teeth and have the longest roots of any human teeth. They are designed to be the first teeth that touch when your jaws close together so they guide the rest of the teeth into the proper bite.<\/p>\n<p>Normally, the maxillary cuspid teeth are the last of the “front” teeth to erupt into place. They usually come into place around age 13 and cause any space left between the upper front teeth to close tighter together. If a cuspid tooth gets impacted, every effort is made to get it to erupt into its proper position in the dental arch. The techniques involved to aid eruption can be applied to any impacted tooth in the upper or lower jaw, but most commonly they are applied to the maxillary cuspid (upper eye) teeth. Sixty percent of these impacted eyeteeth are located on the palatal (roof of the mouth) side of the dental arch. The remaining impacted eye teeth are found in the middle of the supporting bone but stuck in an elevated position above the roots of the adjacent teeth or out to the facial side of the dental arch.<\/p>\n<hr \/>\n<h3>Early Recognition Of Impacted Eyeteeth Is The Key To Successful Treatment<\/h3>\n<p>The older the patient, the more likely an impacted eyetooth will not erupt by nature’s forces alone even if the space is available for the tooth to fit in the dental arch. The American Association of Orthodontists recommends that a panorex screening x-ray, along with a dental examination, be performed on all dental patients at around the age of seven years to count the teeth and determine if there are problems with eruption of the adult teeth. It is important to determine whether all the adult teeth are present or are some adult teeth missing. Are there extra teeth present or unusual growths that are blocking the eruption of the eyetooth? Is there extreme crowding or too little space available causing an eruption problem with the eyetooth? This exam is usually performed by your general dentist or hygienist who will refer you to an orthodontist if a problem is identified. Treating such a problem may involve an orthodontist placing braces to open spaces to allow for proper eruption of the adult teeth. Treatment may also require referral to an oral surgeon for extraction of over-retained baby teeth and\/or selected adult teeth that are blocking the eruption of the all-important eyeteeth. The oral surgeon will also need to remove any extra teeth (supernumerary teeth) or growths that are blocking eruption of any of the adult teeth. If the eruption path is cleared and the space is opened up by age 11-12, there is a good chance the impacted eyetooth will erupt with nature’s help alone. If the eyetooth is allowed to develop too much (age 13-14), the impacted eyetooth will not erupt by itself even with the space cleared for its eruption. If the patient is too old (over 40), there is a much higher chance the tooth will be fused in position. In these cases the tooth will not budge despite all the efforts of the orthodontist and oral surgeon to erupt it into place. Sadly, the only option at this point is to extract the impacted tooth and consider an alternate treatment to replace it in the dental arch (crown on a dental implant or a fixed bridge).<\/p>\n<hr \/>\n<h3>What Happens If The Eyetooth Will Not Erupt When Proper Space Is Available?<\/h3>\n<p>In cases where the eyeteeth will not erupt spontaneously, the orthodontist and oral surgeon work together to get these unerupted eyeteeth to erupt. Each case must be evaluated on an individual basis but treatment will usually involve a combined effort between the orthodontist and the oral surgeon. The most common scenario will call for the orthodontist to place braces on the teeth (at least the upper arch). A space will be opened to provide room for the impacted tooth to be moved into its proper position in the dental arch. If the baby eyetooth has not fallen out already, it is usually left in place until the space for the adult eyetooth is ready. Once the space is ready, the orthodontist will refer the patient to the oral surgeon to have the impacted eyetooth exposed and bracketed.<\/p>\n<p>In a simple surgical procedure performed in the surgeon’s office, the gum on top of the impacted tooth will be lifted up to expose the hidden tooth underneath. If there is a baby tooth present, it will be removed at the same time. Once the tooth is exposed, the oral surgeon will bond an orthodontic bracket to the exposed tooth. The bracket will have a miniature gold chain attached to it. The oral surgeon will guide the chain back to the orthodontic arch wire where it will be temporarily attached. Sometimes the surgeon will leave the exposed impacted tooth completely uncovered by suturing the gum up high above the tooth or making a window in the gum covering the tooth (on selected cases located on the roof of the mouth). Most of the time, the gum will be returned to its original location and sutured back with only the chain remaining visible as it exits a small hole in the gum.<\/p>\n<p>Shortly after surgery (1-14 days) the patient will return to the orthodontist. A rubber band will be attached to the chain to put a light eruptive pulling force on the impacted tooth. This will begin the process of moving the tooth into its proper place in the dental arch. This is a carefully controlled, slow process that may take up to a full year to complete. Remember, the goal is to erupt the impacted tooth and not to extract it! Once the tooth is moved into the arch in its final position, the gum around it will be evaluated to make sure it is sufficiently strong and healthy to last for a lifetime of chewing and tooth brushing. In some circumstances, especially those where the tooth had to be moved a long distance, there may be some minor “gum surgery” required to add bulk to the gum tissue over the relocated tooth so it remains healthy during normal function. Your dentist or orthodontist will explain this situation to you if it applies to your specific situation.<\/p>\n<p>These basic principles can be adapted to apply to any impacted tooth in the mouth. It is not that uncommon for both of the maxillary cuspids to be impacted. In these cases, the space in the dental arch form will be prepared on both sides at once. When the orthodontist is ready the surgeon will expose and bracket both teeth in the same visit so the patient only has to heal from surgery once. Because the anterior teeth (incisors and cuspids) and the bicuspid teeth are small and have single roots, they are easier to erupt if they get impacted than the posterior molar teeth. The molar teeth are much bigger teeth and have multiple roots making them more difficult to move. The orthodontic maneuvers needed to manipulate an impacted molar tooth can be more complicated because of their location in the back of the dental arch.<\/p>\n<p>Recent studies have revealed that with early identification of impacted eyeteeth (or any other impacted tooth other than wisdom teeth) treatment should be initiated at a younger age. Once the general dentist or hygienist identifies a potential eruption problem, the patient should be referred to the orthodontist for early evaluation. In some cases the patient will be sent to the oral surgeon before braces are even applied to the teeth. As mentioned earlier, the surgeon will be asked to remove over-retained baby teeth and\/or selected adult teeth. He will also remove any extra teeth or growths that are blocking eruption of the developing adult teeth. Finally, he may be asked to simply expose an impacted eyetooth without attaching a bracket and chain to it. In reality this is an easier surgical procedure to perform than having to expose and bracket the impacted tooth. This will encourage some eruption to occur before the tooth becomes totally impacted (stuck). By the time the patient is at the proper age for the orthodontist to apply braces to the dental arch, the eyetooth will have erupted enough that the orthodontist can bond a bracket to it and move it into place without needing to force its eruption. In the long run this saves time for the patient and means less time in braces (always a plus for any patient!).<\/p>\n<hr \/>\n<h3>What To Expect From Surgery To Expose &amp; Bracket An Impacted Tooth?<\/h3>\n<p>The surgery to expose and bracket an impacted tooth is a very straightforward surgical procedure that is performed in the oral surgeon’s office. The procedure is generally scheduled for 1 hour and 15 minutes if one tooth is being exposed and bracketed and 1 hour and 45 minutes if both sides require treatment. If the procedure only requires exposing the tooth with no bracketing, the time required will be shortened by about one half. These issues will be discussed in detail at your preoperative consultation with your doctor. You can also refer to <a title=\"Pre-Surgery Instructions\" href=\"http:\/\/drjeffreyleemddmd.com\/pre-surgery-after-surgery\/pre-op-instructions\/\" class=\"broken_link\">Pre-Surgery Instructions<\/a> under Surgical Instructions on this website for a review of any details.<\/p>\n<p>You can expect a limited amount of bleeding from the surgical sites after surgery. Although there will be some discomfort after surgery at the surgical sites, most patients find Tylenol or Advil to be more than adequate to manage any pain they may have. Within two to three days after surgery there is usually little need for any medication at all. There may be some swelling from holding the lip up to visualize the surgical site; it can be minimized by applying ice packs to the lip for the afternoon after surgery. Bruising is not a common finding at all after these cases. A soft, bland diet is recommended at first, but you may resume your normal diet as soon as you feel comfortable chewing. It is advised that you avoid sharp food items like crackers and chips as they will irritate the surgical site if they jab the wound during initial healing. Your doctor will see you seven to ten days after surgery to evaluate the healing process and make sure you are maintaining good oral hygiene. You should plan to see your orthodontist within 1-14 days to activate the eruption process by applying the proper rubber band to the chain on your tooth. As always your doctor is available at the office or can be called after hours if any problems should arise after surgery. Simply call our office at 714-734-9363 if you have any questions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>An impacted tooth simply means that it is “stuck” and cannot erupt into function. Patients frequently develop problems with impacted third molar (wisdom) teeth. These teeth get “stuck” in the back of the jaw and can develop painful infections among a host of other problems (see Wisdom Teeth under Services). Since there is rarely a [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":36,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Impacted Canines | Office of Jeffrey Lee, MD DMD<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/drjeffreyleemddmd.com\/procedures\/impacted-canines\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Impacted Canines | Office of Jeffrey Lee, MD DMD\" \/>\n<meta property=\"og:description\" content=\"An impacted tooth simply means that it is “stuck” and cannot erupt into function. Patients frequently develop problems with impacted third molar (wisdom) teeth. These teeth get “stuck” in the back of the jaw and can develop painful infections among a host of other problems (see Wisdom Teeth under Services). Since there is rarely a [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/drjeffreyleemddmd.com\/procedures\/impacted-canines\/\" \/>\n<meta property=\"og:site_name\" content=\"Office of Jeffrey Lee, MD DMD\" \/>\n<meta property=\"article:modified_time\" content=\"2012-05-15T15:41:03+00:00\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#organization\",\"name\":\"Office of Jeffrey Lee, MD DMD\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/\",\"sameAs\":[],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/wp-content\/uploads\/2013\/01\/feat-dr-lee-dr-suit.jpg\",\"contentUrl\":\"https:\/\/drjeffreyleemddmd.com\/wp-content\/uploads\/2013\/01\/feat-dr-lee-dr-suit.jpg\",\"width\":430,\"height\":290,\"caption\":\"Office of Jeffrey Lee, MD DMD\"},\"image\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#website\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/\",\"name\":\"Office of Jeffrey Lee, MD DMD\",\"description\":\"Board Certified Oral &amp; Maxillofacial Surgeon\",\"publisher\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/drjeffreyleemddmd.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/procedures\/impacted-canines\/#webpage\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/procedures\/impacted-canines\/\",\"name\":\"Impacted Canines | Office of Jeffrey Lee, MD DMD\",\"isPartOf\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#website\"},\"datePublished\":\"2012-03-05T19:38:44+00:00\",\"dateModified\":\"2012-05-15T15:41:03+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/procedures\/impacted-canines\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/drjeffreyleemddmd.com\/procedures\/impacted-canines\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/procedures\/impacted-canines\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/drjeffreyleemddmd.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Services\",\"item\":\"https:\/\/drjeffreyleemddmd.com\/procedures\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Impacted Canines\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/759"}],"collection":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/comments?post=759"}],"version-history":[{"count":13,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/759\/revisions"}],"predecessor-version":[{"id":1161,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/759\/revisions\/1161"}],"up":[{"embeddable":true,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/36"}],"wp:attachment":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/media?parent=759"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}