{"id":80,"date":"2011-12-06T02:24:56","date_gmt":"2011-12-06T02:24:56","guid":{"rendered":"http:\/\/www.oralsurgeonorangecounty.org\/?page_id=80"},"modified":"2021-11-18T04:37:33","modified_gmt":"2021-11-18T04:37:33","slug":"after-wisdom-tooth-extraction","status":"publish","type":"page","link":"https:\/\/drjeffreyleemddmd.com\/after-wisdom-tooth-extraction\/","title":{"rendered":"After Wisdom Tooth Extraction"},"content":{"rendered":"<p>The removal of impacted teeth is a major surgical procedure. Post-operative care is extremely important. Pain and complications of swelling and infection are not necessary and can be minimized if the instructions are carefully followed.<\/p>\n<h3>Immediately Following Surgery<\/h3>\n<ul>\n<li>Keep the gauze pad that is placed over the surgery area in its place for half an hour. After this time, remove and discard the gauze pad.<\/li>\n<li>Avoid forceful or excessive mouth rinsing or touching the area of the wound following the surgery. These actions could initiate bleeding by dislodging the blood clot that has formed.<\/li>\n<li>Begin taking the prescribed pain medications as soon as you start to feel any discomfort. This will usually occur when the local anesthetic begins to diminish.<\/li>\n<li>Restrict your activities the day of your surgery and resume regular activity when you feel well.<\/li>\n<li>Place ice packs on the sides of your face where the surgery was performed. See section &#8220;Swelling&#8221; for further information.<\/li>\n<\/ul>\n<h3>Bleeding<\/h3>\n<p>There is a certain amount of bleeding that occurs after the surgery. Slight bleeding, oozing or redness in the saliva is common. Excessive bleeding can be reduced by rinsing or wiping any old clots from your mouth and then placing a new gauze pad over the area and biting firmly for half an hour. Repeat if needed. If bleeding continues to occur, bite on a moistened tea bag for half an hour.<\/p>\n<p>The tannic acid in the tea bag helps to form a clot by contracting bleeding vessels. To minimize further bleeding, do not become excited, sit upright, and avoid exercise. If bleeding does not subside, call for further instructions.<\/p>\n<h3>Swelling<\/h3>\n<p>The swelling that is normally expected is usually proportional to the surgery involved. Swelling around the mouth, cheeks, eyes and sides of the face is not uncommon. This is the body’s normal reaction to surgery and eventual repair. The swelling will not become apparent until the day following surgery and will not reach its maximum until 2-3 days post-operatively. However the swelling may be minimized by the immediate use of ice packs. Two baggies filled with ice or ice packs should be applied to the sides of the face where surgery was performed. The ice packs should be left on continuously while you are awake. After 36 hours ice has no beneficial effect. If swelling or jaw stiffness has persisted for several days, there is no cause for alarm. This is a normal reaction to surgery. Thirty-six hours following surgery the application of moist heat to the sides of the face is beneficial in reducing the size of the swelling.<\/p>\n<h3>Pain<\/h3>\n<p>For moderate pain, one or two tablets of Tylenol or Extra Strength Tylenol may be taken every 4 hours or Ibuprofen, (Motrin or Advil) two-four 200 mg tablets may be taken every 6 hours.<\/p>\n<p>For severe pain, take the tablets prescribed as directed. The prescribed pain medicine will make you groggy and will slow down your reflexes. Do not drive an automobile or work around machinery. Avoid alcoholic beverages. Pain or discomfort following surgery should subside more and more every day. If pain persists, it may require attention and you should call the office.<\/p>\n<h3>Diet<\/h3>\n<p>After general anesthetic or I.V. sedation, liquids should be initially taken. Do not use straws. Drink from a glass. The sucking motion can cause more bleeding by dislodging the blood clot. You may eat anything soft by chewing away form the surgical sites. High calorie, high protein intake is very important. Refer to the section on suggested diet instructions at the end of the brochure. Nourishment should be taken regularly. You should prevent dehydration by taking fluids regularly. Your food intake will be limited for the first few days. You should compensate for this by increasing your fluid intake. At least 5-6 glasses of liquid should be taken daily. Try not to miss a single meal. You will feel better, have more strength, less discomfort and heal faster if you continue to eat.<\/p>\n<p><strong>Caution:<\/strong> If you suddenly sit up or stand from a lying position you may become dizzy. If you are lying down following surgery, make sure you sit for one minute before standing.<\/p>\n<h3>Keep the mouth clean<\/h3>\n<p>No rinsing of any kind should be performed until the day following surgery. You can brush your teeth the night of surgery but rinse gently. The day after surgery you should begin rinsing at least 5-6 times a day especially after eating with a cup of warm water mixed with a teaspoon of salt.<strong><\/strong><\/p>\n<h3>Discoloration<\/h3>\n<p>In some cases, discoloration of the skin follows swelling. The development of black, blue, green or yellow discoloration is due to blood spreading beneath the tissues. This is a normal post-operative occurrence which may occur 2-3 days post-operatively. Moist heat applied to the area may speed up the removal of the discoloration.<\/p>\n<h3>Antibiotics<\/h3>\n<p>If you have been placed on antibiotics, take the tablets or liquid as directed. Antibiotics will be given to help prevent infection. Discontinue antibiotic use in the event of a rash or other unfavorable reaction. Call the office if you have any questions.<\/p>\n<h3>Nausea and Vomiting<\/h3>\n<p>In the event of nausea and\/or vomiting following surgery, do not take anything by mouth for at least an hour including the prescribed medicine. You should then sip on coke, tea or ginger ale. You should sip slowly over a fifteen-minute period. When the nausea subsides you can begin taking solid foods and the prescribed medicine.<\/p>\n<h3>Other Complications<\/h3>\n<ul>\n<li>If numbness of the lip, chin or tongue occurs there is no cause for alarm. As stated before surgery this is usually temporary in nature. You should be aware that if your lip or tongue is numb you could bite it and not feel the sensation. Call Dr. Lee if you have any questions.<\/li>\n<li>Slight elevation of temperature immediately following surgery is not uncommon. If the temperature persists, notify the office. Tylenol or Ibuprofen should be taken to reduce the fever.<\/li>\n<li>You should be careful going from the lying down position to standing. You were not able to eat or drink prior to surgery. It was also difficult to take fluids. Taking pain medications can make you dizzy. You could get light headed when you stand up suddenly. Before standing up you should sit for one minute then get up.<\/li>\n<li>Occasionally patients may feel hard projections in the mouth with their tongue. They are not roots; they are the bony walls which supported the tooth. These projections usually smooth out spontaneously. If not they can be removed by Dr. Lee.<\/li>\n<li>If the corners of your mouth are stretched, they may dry out and crack. Your lips should be kept moist with an ointment such as petroleum jelly.<\/li>\n<li>Sore throats and pain when swallowing are not uncommon. The muscles get swollen. The normal act of swallowing can then become painful. This will subside in 2-3 days.<\/li>\n<li>Stiffness (Trismus) of the jaw muscles may cause difficulty in opening your mouth for a few days following surgery. This is a normal post-operative event which will resolve in time.<\/li>\n<\/ul>\n<h3>Additional Information<strong><br \/>\n<\/strong><\/h3>\n<p>Sutures are placed the area of surgery to minimize post-operative bleeding and to help healing. Sometimes they become dislodged but this is no cause for alarm. Just remove the suture form your mouth and discard it. The sutures dissolve naturally in your mouth within a week.<\/p>\n<p>The pain and swelling should subside more and more each day following surgery. If your post-operative pain or swelling worsens or unusual symptoms occur call my office for instructions.<\/p>\n<p>There will be a cavity where the tooth was removed. The cavity will gradually over the next month fill in with the new tissue. In the meantime the area should be kept clean, especially after meals with salt water rinses or a toothbrush.<\/p>\n<p>If you are involved in regular exercise, be aware that your normal nourishment intake is reduced. Exercise may weaken you. If you get light headed stop exercising.<\/p>\n<p>Brushing your teeth is okay – just be gentle at the surgical sites.<\/p>\n<p>A dry socket is when the blood clot gets dislodged prematurely from the tooth socket. Symptoms of pain at the surgical site and even pain to the ear may occur 2-3 days following surgery. <a title=\"Contact Us\" href=\"http:\/\/drjeffreyleemddmd.com\/contact\/\">Contact<\/a> our office if this occurs.<\/p>\n<p>Your case is individual; no two mouths are alike. We encourage our patients to contact our office to discuss any problems with Dr. Lee.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The removal of impacted teeth is a major surgical procedure. Post-operative care is extremely important. Pain and complications of swelling and infection are not necessary and can be minimized if the instructions are carefully followed. Immediately Following Surgery Keep the gauze pad that is placed over the surgery area in its place for half an [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>After Wisdom Tooth Extraction | Office of Jeffrey Lee, MD DMD<\/title>\n<meta name=\"description\" content=\"Read this page to learn the proper care and precautions to take after wisdom tooth extraction procedures.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/drjeffreyleemddmd.com\/after-wisdom-tooth-extraction\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"After Wisdom Tooth Extraction | Office of Jeffrey Lee, MD DMD\" \/>\n<meta property=\"og:description\" content=\"Read this page to learn the proper care and precautions to take after wisdom tooth extraction procedures.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/drjeffreyleemddmd.com\/after-wisdom-tooth-extraction\/\" \/>\n<meta property=\"og:site_name\" content=\"Office of Jeffrey Lee, MD DMD\" \/>\n<meta property=\"article:modified_time\" content=\"2021-11-18T04:37:33+00:00\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"7 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#organization\",\"name\":\"Office of Jeffrey Lee, MD DMD\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/\",\"sameAs\":[],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/wp-content\/uploads\/2013\/01\/feat-dr-lee-dr-suit.jpg\",\"contentUrl\":\"https:\/\/drjeffreyleemddmd.com\/wp-content\/uploads\/2013\/01\/feat-dr-lee-dr-suit.jpg\",\"width\":430,\"height\":290,\"caption\":\"Office of Jeffrey Lee, MD DMD\"},\"image\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#website\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/\",\"name\":\"Office of Jeffrey Lee, MD DMD\",\"description\":\"Board Certified Oral &amp; Maxillofacial Surgeon\",\"publisher\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/drjeffreyleemddmd.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/after-wisdom-tooth-extraction\/#webpage\",\"url\":\"https:\/\/drjeffreyleemddmd.com\/after-wisdom-tooth-extraction\/\",\"name\":\"After Wisdom Tooth Extraction | Office of Jeffrey Lee, MD DMD\",\"isPartOf\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/#website\"},\"datePublished\":\"2011-12-06T02:24:56+00:00\",\"dateModified\":\"2021-11-18T04:37:33+00:00\",\"description\":\"Read this page to learn the proper care and precautions to take after wisdom tooth extraction procedures.\",\"breadcrumb\":{\"@id\":\"https:\/\/drjeffreyleemddmd.com\/after-wisdom-tooth-extraction\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/drjeffreyleemddmd.com\/after-wisdom-tooth-extraction\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/drjeffreyleemddmd.com\/after-wisdom-tooth-extraction\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/drjeffreyleemddmd.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"After Wisdom Tooth Extraction\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/80"}],"collection":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/comments?post=80"}],"version-history":[{"count":7,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/80\/revisions"}],"predecessor-version":[{"id":2256,"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/pages\/80\/revisions\/2256"}],"wp:attachment":[{"href":"https:\/\/drjeffreyleemddmd.com\/wp-json\/wp\/v2\/media?parent=80"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}